# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
import pandas as pd

conn = sqlite3.connect("data.sqlite")
c = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [2]:
#Your code here
c.execute('''SELECT lastName, firstName FROM employees JOIN offices USING (officeCode) WHERE city = "Boston"''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

    lastName firstName
0   Firrelli     Julie
1  Patterson     Steve

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [3]:
#Your code here
c.execute('''SELECT city, COUNT(*) FROM offices LEFT JOIN employees USING (officeCode) GROUP BY officeCode''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

            city  COUNT(*)
0  San Francisco         6
1         Boston         2
2            NYC         2
3          Paris         5
4          Tokyo         2
5         Sydney         4
6         London         2

## Write 3 Questions of your own and answer them

In [4]:
# Answers will vary
# How many orders each customer makes?
# Which customer spent the most money?
# How many products each product line has?

In [5]:
# How many orders each customer makes?
c.execute('''SELECT customerName, COUNT(*) AS num_orders
             FROM customers LEFT JOIN orders USING (customerNumber)
             GROUP BY customerNumber
             ORDER BY num_orders''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
print(len(df))
df.head()

122

                 customerName  num_orders
0          Havel & Zbyszek Co           1
1      American Souvenirs Inc           1
2           Porto Imports Co.           1
3  Asian Shopping Network, Co           1
4             Natürlich Autos           1

In [6]:
# Which customer spent the most money?
c.execute('''SELECT customerName, SUM(amount)
             FROM customers LEFT JOIN payments USING (customerNumber)
             GROUP BY customerNumber
             ORDER BY SUM(amount) DESC
             LIMIT 1''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
print(len(df))
df

1

             customerName  SUM(amount)
0  Euro+ Shopping Channel    715738.98

In [7]:
# How many products each product line has?
c.execute('''SELECT productLine, COUNT(*) AS num_products
             FROM productlines LEFT JOIN products USING (productLine)
             GROUP BY productLine
             ORDER BY num_products DESC''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
print(len(df))
df

7

        productLine  num_products
0      Classic Cars            38
1      Vintage Cars            24
2       Motorcycles            13
3            Planes            12
4  Trucks and Buses            11
5             Ships             9
6            Trains             3

## Level Up: Display the names of each product each employee has sold

In [8]:
# Your code here
c.execute('''SELECT lastName, firstName, productName
             FROM employees JOIN customers ON employees.employeeNumber = customers.salesRepEmployeeNumber
             JOIN orders USING (customerNumber)
             JOIN orderdetails USING (orderNumber)
             JOIN products USING (productCode)''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
print(len(df))
df.head()

2996

   lastName firstName                                  productName
0  Jennings    Leslie                               1958 Setra Bus
1  Jennings    Leslie                       1940 Ford Pickup Truck
2  Jennings    Leslie                      1939 Cadillac Limousine
3  Jennings    Leslie  1996 Peterbilt 379 Stake Bed with Outrigger
4  Jennings    Leslie                            1968 Ford Mustang

## Level Up: Display the Number of Products each employee has sold

In [9]:
#Your code here
c.execute('''SELECT lastName, firstName, COUNT(productName)
             FROM employees LEFT JOIN customers ON employees.employeeNumber = customers.salesRepEmployeeNumber
             JOIN orders USING (customerNumber)
             JOIN orderdetails USING (orderNumber)
             JOIN products USING (productCode)
             GROUP BY employeeNumber
             ORDER BY firstName''')
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
print(len(df))
df

15

     lastName firstName  COUNT(productName)
0      Fixter      Andy                 185
1       Jones     Barry                 220
2       Tseng  Foon Yue                 142
3      Vanauf    George                 211
4   Hernandez    Gerard                 396
5    Firrelli     Julie                 124
6        Bott     Larry                 236
7    Jennings    Leslie                 331
8    Thompson    Leslie                 114
9      Bondur      Loui                 177
10      Nishi      Mami                 137
11     Gerard    Martin                 114
12   Castillo    Pamela                 272
13      Marsh     Peter                 185
14  Patterson     Steve                 152

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!